# -*- coding: utf-8 -*-
"""
Created on Sun Jul 16 11:15:40 2023

@author: Marko
"""

import numpy as np
# перетворюємо наведений нижче одновимірний масив з 12
# елементів у двовимірний масив. Зовнішній розмір матиме
# 4 масиви, кожен з яких містить 3 елементи
arr = np.array([1,2,3,4,5,6,7,8,9,10,11,12])
newarr = arr.reshape(4, 3)
print(newarr)

# перетворюємо наведений масив з 12 елементів у тривимірний
# масив. Зовнішній розмір матиме 2 масиви, які містять 3 масиви
# кожен з яких містить 2 елементи
newarr = arr.reshape(2,3,2)
print(newarr)

# ми можемо переформатквати 8-елементний масив у 4 елементий
# 2-рядковий 2Д масив, але ми не можемо переформатувати його в 
# 3-елементний 3-рядковий 2д масив, оскілько для цього знадобиться
# 3*3=9 елементів
arr = np.array([1,2,3,4,5,6,7,8])
newarr = arr.reshape(2,4)
print(newarr)
# Error ValueError
#newarr = arr.reshape(3,3)
#print(newarr)

print(arr.reshape(2,4).base)

# дозволено мати один невідомий вимір, не потрібно вказувати
# точне число для одного з розмірів у методі зміни форми
# Передайте -1 як значення, i NumPy обчислить це число для вас
newarr = arr.reshape(2,2,-1)
print(newarr)

# Зведення масиву означає перетворення багатовимірного масиву
# в одновимірний масив. Ми можемо використовувати 
# reshape(-1) для цього
arr = np.array([[1,2,3],[4,5,6]])
newarr = arr.reshape(-1)
print(newarr)