# -*- coding: utf-8 -*-
"""
Created on Wed May 17 11:55:15 2023

@author: Marko
"""

import numpy as np
arr = np.array([1,2,3,4])
# отримайте перший елемент
print(arr[0])
# отримайте другий елемент
print(arr[1])
# отримайте третій і четвертий елементи та додайте їх
print(arr[2] + arr[3])
# щоб отримати доступ до еле-в із 2-D масиву, ми можемо
# використовувати цілі числа, розділені комами, що 
# представляють розмірність та індекс елемента
arr = np.array([[1,2,3,4,5],[6,7,8,9,10]])
print("2nd element on 1st row: ", arr[0,1])
print("1st element on 2nd row: ", arr[1,0])
print("5th element on 2nd row: ", arr[1,4])

# доступ до 3-D масивів
arr = np.array([[[1,2,3],[4,5,6]],[[7,8,9],[10,11,12]]])
# доступ до першого елемента другого підмасиву другого масиву
print(arr[1,1,0])
# негативна індексація, вивести від кінця масиву
arr = np.array([[1,2,3,4,5],[6,7,8,9,10]])
print("Last element from 2nd dim: ",arr[1,-1])
